minombreesjeff/darwin_env/cups/man/cupsd.man
.\"
.\" "$Id: cupsd.man,v 1.1.1.7 2004/06/05 02:42:32 jlovell Exp $"
.\"
.\"   cupsd man page for the Common UNIX Printing System (CUPS).
.\"
.\"   Copyright 1997-2003 by Easy Software Products.
.\"
.\"   These coded instructions, statements, and computer programs are the
.\"   property of Easy Software Products and are protected by Federal
.\"   copyright law.  Distribution and use rights are outlined in the file
.\"   "LICENSE.txt" which should have been included with this file.  If this
.\"   file is missing or damaged please contact Easy Software Products
.\"   at:
.\"
.\"       Attn: CUPS Licensing Information
.\"       Easy Software Products
.\"       44141 Airport View Drive, Suite 204
.\"       Hollywood, Maryland 20636-3111 USA
.\"
.\"       Voice: (301) 373-9603
.\"       EMail: cups-info@cups.org
.\"         WWW: http://www.cups.org
.\"
.TH cupsd 8 "Common UNIX Printing System" "18 July 2002" "Easy Software Products"
.SH NAME
cupsd \- common unix printing system daemon
.SH SYNOPSIS
.B cupsd
[ \-c
.I config-file
] [ \-f ] [ \-F ]
.SH DESCRIPTION
\fIcupsd\fR is the scheduler for the Common UNIX Printing System. It
implements a printing system based upon the Internet Printing Protocol,
version 1.1.  If no options are specified on the command-line then the
default configuration file (usually \fI/etc/cups/cupsd.conf\fR) will be
used.
.PP
The \fI-f\fR option forces \fIcupsd\fR to run in the foreground; the
default is to run in the background as a "daemon".
.PP
The \fI-F\fR option forces \fIcupsd\fR to run in the foreground
but detaches the process from the controlling terminal and
current directory. This is useful for running \fIcupsd\fR from
\fIinit\fR.
.SH COMPATIBILITY
\fIcupsd\fR implements all of the required IPP/1.1 attributes and
operations. It also implements several CUPS-specific administation
operations.
.SH SEE ALSO
backend(1), classes.conf(5), cupsd.conf(5), filter(1), mime.convs(5),
mime.types(5), printers.conf(5),
CUPS Implementation of IPP,
CUPS Interface Design Description,
CUPS Software Administrators Manual,
http://localhost:631/documentation.html
.SH COPYRIGHT
Copyright 1993-2003 by Easy Software Products, All Rights Reserved.
.\"
.\" End of "$Id: cupsd.man,v 1.1.1.7 2004/06/05 02:42:32 jlovell Exp $".
.\"
