minombreesjeff/darwin_env/cups/man/lpq.man
.\"
.\" "$Id: lpq.man,v 1.1.1.7 2004/06/05 02:42:32 jlovell Exp $"
.\"
.\"   lpq man page for the Common UNIX Printing System (CUPS).
.\"
.\"   Copyright 1997-2003 by Easy Software Products.
.\"
.\"   These coded instructions, statements, and computer programs are the
.\"   property of Easy Software Products and are protected by Federal
.\"   copyright law.  Distribution and use rights are outlined in the file
.\"   "LICENSE.txt" which should have been included with this file.  If this
.\"   file is missing or damaged please contact Easy Software Products
.\"   at:
.\"
.\"       Attn: CUPS Licensing Information
.\"       Easy Software Products
.\"       44141 Airport View Drive, Suite 204
.\"       Hollywood, Maryland 20636-3111 USA
.\"
.\"       Voice: (301) 373-9603
.\"       EMail: cups-info@cups.org
.\"         WWW: http://www.cups.org
.\"
.TH lpq 1 "Common UNIX Printing System" "13 February 2001" "Easy Software Products"
.SH NAME
lpq \- show printer queue status
.SH SYNOPSIS
.B lpq
[ -E ] [ \-P
.I dest
] [ \-a ] [ \-l ] [
.I +interval
]
.SH DESCRIPTION
\fIlpq\fR shows the current print queue status on the named printer.
Jobs queued on the default destination will be shown if no printer or
class is specified on the command-line.
.LP
The \fIinterval\fR option allows you to continuously report the jobs
in the queue until the queue is empty; the list of jobs is show one
every \fIinterval\fR seconds.
.LP
The \fI-E\fR option forces encryption when connecting to the server.
.LP
The \fI-a\fR option reports jobs on all printers.
.LP
The \fI-l\fR option requests a more verbose (long) reporting format.
.SH SEE ALSO
cancel(1), lp(1), lpr(1), lprm(1), lpstat(1)
.br
CUPS Software Users Manual,
http://localhost:631/documentation.html
.SH COPYRIGHT
Copyright 1993-2003 by Easy Software Products, All Rights Reserved.
.\"
.\" End of "$Id: lpq.man,v 1.1.1.7 2004/06/05 02:42:32 jlovell Exp $".
.\"
